<a href="https://colab.research.google.com/github/razzlestorm/Learn-Pandas/blob/master/Eddie's_Playground.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [143]:
import pandas as pd
# Pandas creates a DataFrame from the sample csv that comes with every colab.
df = pd.read_csv('/content/sample_data/california_housing_test.csv')
df.head()

   longitude  latitude  ...  median_income  median_house_value
0    -122.05     37.37  ...         6.6085            344700.0
1    -118.30     34.26  ...         3.5990            176500.0
2    -117.81     33.78  ...         5.7934            270500.0
3    -118.36     33.82  ...         6.1359            330000.0
4    -119.67     36.33  ...         2.9375             81700.0

[5 rows x 9 columns]

In [0]:
# This adds a column onto the existing dataframe that checks whether or not each row meets some sort of condition (in this case housing age and total bedrooms)
# This could be replaced with something like (df['PAST DUE DAYS'] == 10) & df['Year'] == 2013 & df['Quarter'] == Q1
df['count'] = (df['housing_median_age'] == 27.0) & (df['total_bedrooms'] == 507.0)

In [145]:
# Here we can see what that looks like
df.head()

   longitude  latitude  ...  median_house_value  count
0    -122.05     37.37  ...            344700.0  False
1    -118.30     34.26  ...            176500.0  False
2    -117.81     33.78  ...            270500.0   True
3    -118.36     33.82  ...            330000.0  False
4    -119.67     36.33  ...             81700.0  False

[5 rows x 10 columns]

In [146]:
# Pandas also has a .value_counts() method that we can use to see how many of each value is in a column (called a Series in pandas)
df['count'].value_counts()

False    2999
True        1
Name: count, dtype: int64

In [147]:
# Using sum(), we can create an int that we can use easily later.
sum(df['count'].value_counts() == True)

1

In [148]:
# Make sure to upload the csv before running this cell. Files are not saved between sessions.
live = pd.read_csv('/content/live.csv')
live.head()

   Unnamed: 0  S/N      ACCOUNT   ... ACCOUNT SEGMENT  Year Quarter
0           2  3.0   81011753418  ...       Term Loan  2013      Q1
1           3  4.0   91011979519  ...       Term Loan  2013      Q1
2           4  5.0  181018354017  ...       Term Loan  2013      Q1
3           5  6.0   31012008913  ...       Term Loan  2013      Q1
4           6  7.0   61015631812  ...       Term Loan  2013      Q1

[5 rows x 8 columns]

In [149]:
print(live.shape)
live.describe()

(65828, 8)

         Unnamed: 0           S/N  PAST DUE DAYS          Year
count  65828.000000  65828.000000   65828.000000  65828.000000
mean   48110.690709   2004.858601      35.553564   2015.489943
std    27779.874460   1157.299054       9.021698      1.705043
min        2.000000      1.000000      10.000000   2013.000000
25%    24050.750000   1003.000000      30.000000   2014.000000
50%    48109.500000   2005.000000      40.000000   2015.000000
75%    72168.250000   3007.000000      40.000000   2017.000000
max    96227.000000   4035.000000      50.000000   2018.000000

In [150]:
years = [2013, 2014, 2015, 2016, 2017, 2018]
quarters = ['Q1', 'Q2', 'Q3', 'Q4']

def findsum(value, yearlist=years, quarterlist=quarters):
    '''
    value: days past due to check. No default
    yearlist: number of years you want to search in the dataframe, default is 2013-2018.
    quarters: number of quarters in each year, default is 4, formatted as 'Q1', 'Q2', etc.
    '''
    past_due = []
    for year in yearlist:
        for quarter in quarterlist:
            past_due.append((len(live[(live['Year'] == year) & (live['Quarter'] == quarter) & (live['PAST DUE DAYS'] == value)])))
    return past_due   

sum_of_tens = findsum(10, years, quarters)
print(sum_of_tens)

[2751, 0, 0, 0, 9, 9, 9, 9, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0]

In [151]:
columns = pd.MultiIndex.from_product([years, quarters])

tens = pd.DataFrame([sum_of_tens], index=['Ten Days Past Due'], columns=columns)
tens

                   2013          2014           ... 2017          2018
                     Q1 Q2 Q3 Q4   Q1 Q2 Q3 Q4  ...   Q1 Q2 Q3 Q4   Q1 Q2 Q3 Q4
Ten Days Past Due  2751  0  0  0    9  9  9  9  ...    0  0  0  0    0  0  0  0

[1 rows x 24 columns]

In [152]:
live['PAST DUE DAYS'].value_counts(dropna=False)

40    35557
30    17184
50     5625
20     4675
10     2787
Name: PAST DUE DAYS, dtype: int64

In [0]:
twenties = pd.DataFrame([findsum(20, years, quarters)], index=['Twenty Days Past Due'], columns=columns)

In [154]:
tens.append(twenties)

                      2013                2014        ... 2017       2018
                        Q1    Q2    Q3 Q4   Q1 Q2 Q3  ...   Q2 Q3 Q4   Q1 Q2 Q3 Q4
Ten Days Past Due     2751     0     0  0    9  9  9  ...    0  0  0    0  0  0  0
Twenty Days Past Due     0  2751  1906  0    0  0  0  ...    0  0  0    0  0  0  0

[2 rows x 24 columns]